Rotina/envio.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://webservice.econsig.bmg.com" xmlns:ns2="http://parameter.common.econsig.bmg.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns3="http://localhost:8080/webservices/ConsultaStatusAde" xmlns:xsd="http://www.w3.org/2001/XMLSchema" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:consultaStatusAde><param xsi:type="ns1:ConsultaStatusAdeParameter"><login xsi:type="SOAP-ENC:string">ROBO.52849</login><senha xsi:type="SOAP-ENC:string">ROBO*52849</senha><dataFinal xsi:nil="true"/><dataInicial xsi:nil="true"/><listaAdes SOAP-ENC:arrayType="SOAP-ENC:string[55]" xsi:type="ns3:ArrayOf_soapenc_string"><item xsi:type="SOAP-ENC:string">7</item><item xsi:type="SOAP-ENC:string">6</item><item xsi:type="SOAP-ENC:string">5</item><item xsi:type="SOAP-ENC:string">4</item><item xsi:type="SOAP-ENC:string">3</item><item xsi:type="SOAP-ENC:string">2</item><item xsi:type="SOAP-ENC:string">15</item><item xsi:type="SOAP-ENC:string">14</item><item xsi:type="SOAP-ENC:string">13</item><item xsi:type="SOAP-ENC:string">12</item><item xsi:type="SOAP-ENC:string">11</item><item xsi:type="SOAP-ENC:string">10</item><item xsi:type="SOAP-ENC:string">9</item><item xsi:type="SOAP-ENC:string">8</item><item xsi:type="SOAP-ENC:string">1</item><item xsi:type="SOAP-ENC:string">348284757</item><item xsi:type="SOAP-ENC:string">747942627</item><item xsi:type="SOAP-ENC:string">347595743</item><item xsi:type="SOAP-ENC:string">347578533</item><item xsi:type="SOAP-ENC:string">347530338</item><item xsi:type="SOAP-ENC:string">347529504</item><item xsi:type="SOAP-ENC:string">347481536</item><item xsi:type="SOAP-ENC:string">746565414</item><item xsi:type="SOAP-ENC:string">745585449</item><item xsi:type="SOAP-ENC:string">745451518</item><item xsi:type="SOAP-ENC:string">6726137</item><item xsi:type="SOAP-ENC:string">13185183</item><item xsi:type="SOAP-ENC:string">66054345</item><item xsi:type="SOAP-ENC:string">6705092</item><item xsi:type="SOAP-ENC:string">1734230972</item><item xsi:type="SOAP-ENC:string">66887227</item><item xsi:type="SOAP-ENC:string">1301926</item><item xsi:type="SOAP-ENC:string">6728706</item><item xsi:type="SOAP-ENC:string">6671228</item><item xsi:type="SOAP-ENC:string">6670251</item><item xsi:type="SOAP-ENC:string">65959085</item><item xsi:type="SOAP-ENC:string">62927662</item><item xsi:type="SOAP-ENC:string">1433118693</item><item xsi:type="SOAP-ENC:string">6535484</item><item xsi:type="SOAP-ENC:string">65137991</item><item xsi:type="SOAP-ENC:string">64076991</item><item xsi:type="SOAP-ENC:string">991479877</item><item xsi:type="SOAP-ENC:string">972335838</item><item xsi:type="SOAP-ENC:string">6391144</item><item xsi:type="SOAP-ENC:string">1636203512</item><item xsi:type="SOAP-ENC:string">636232144</item><item xsi:type="SOAP-ENC:string">94430480</item><item xsi:type="SOAP-ENC:string">62587214</item><item xsi:type="SOAP-ENC:string">62347026</item><item xsi:type="SOAP-ENC:string">62358193</item><item xsi:type="SOAP-ENC:string">62226468</item><item xsi:type="SOAP-ENC:string">62018594</item><item xsi:type="SOAP-ENC:string">61988883</item><item xsi:type="SOAP-ENC:string">61958160</item><item xsi:type="SOAP-ENC:string">60537305</item></listaAdes><loginConsig xsi:nil="true"/><senhaConsig xsi:nil="true"/></param></ns1:consultaStatusAde></SOAP-ENV:Body></SOAP-ENV:Envelope>
